package ru.prostor.sections.section_1.paragraph_2;

/**
 * Кривая дракона. Напишите программу, которая выводит инфтсрукции для рисования
 * кривых дракона разного порядка, от 0 до 5. Инструкции выглядят как цепочка символов
 * F, L, R - где F означает нарисовать линию на 1 в перёд, L - повернуть на лево, К -
 * повернуть на право. Чтобы получить кривую дракона порядка n, сложите полоску бумаги поплам n раз,
 * а затем разверните с прямыми углами. Чтобы решить эту задачу, заметим что кривая порядка n
 * является кривой порядка n - 1, за которой следует инструкция L и кривая порядка n - 1, ъ
 * обходимая в обратном порядке.
 * */
public class Exercise_35 {
}
